Table of Contents
 Interface IIdeaObject
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represents named and identifiable BIM object.
 Names of the objects are general strings and there are no guarantees about their content. The names can be null strings, empty or any generic text value, event duplicated across the model, if the original BIM software allows that.
 Identifiers of the objects are strings that are guaranteed to be:
globally unique within the scope of the current model.
constant when the model is changed.
 are qua
public interface IIdeaObject
Properties
 Id
Identification of the object. The ids of the objects are guaranteed to be unique withing the scope of the model and constant. See IIdeaObject interface comment for more details.
string Id { get; }
Property Value
string
 Name
Name of the object, or null if the object does not have a name. The object name is not guaranteed to be defined or unique.
string Name { get; }
Property Value
string
 Edit this page